# GetAddInName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AddInId..::..GetAddInName Method
AddInId Class See Also
---
name of addin associated with this AddInId Attempts to obtain the name from loaded Third Party AddIns
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string GetAddInName()
```

Visual Basic
---
```text
Public Function GetAddInName As String
```

Visual C++
---
```text
public:
String^ GetAddInName()
```

# ### Return Value
name of addin
# See Also
AddInId Class
Autodesk.Revit.DB Namespace